In [1]:
import pandas as pd

In [2]:
animals = {
    'n1': 'Tiger',
    'n2': 'Bear',
    'n3': None
}
p_animals = pd.Series(animals)
p_animals

n1    Tiger
n2     Bear
n3     None
dtype: object

In [3]:
print(p_animals.iloc[2])

None

In [4]:
type(p_animals)

pandas.core.series.Series

In [5]:
p_animals.index

Index(['n1', 'n2', 'n3'], dtype='object')

In [6]:
p_animals.values

array(['Tiger', 'Bear', None], dtype=object)

In [7]:
p_animals = pd.Series(
    ['Tiger', 'Bear', 'Moose'],
    index=['n1', 'n2', 'n3']
)
p_animals

n1    Tiger
n2     Bear
n3    Moose
dtype: object

In [8]:
p_animals['n1']

'Tiger'

In [9]:
p_animals.loc['n1']

'Tiger'

In [10]:
for item in p_animals:
    print(f"Salam {item}")

Salam Tiger
Salam Bear
Salam Moose

In [11]:
import numpy as np

In [12]:
animals = [2.0, 20.1, 5]
p_animals = pd.Series(animals)
np.sum(p_animals)

27.1

In [13]:
animals = [2.0, 20.1, "Masoud"]
p_animals = pd.Series(animals)

In [14]:
for index, item in p_animals.items():
    print(f"Salam {item} ... index is {index}")

Salam 2.0 ... index is 0
Salam 20.1 ... index is 1
Salam Masoud ... index is 2

In [15]:
animals = {
    'n1': 'Tiger',
    'n2': 'Bear',
    'n3': 'Moose'
}
p_animals = pd.Series(animals)
animals = {
    'n1': 'Tiger2',
    'n2': 'Bear2',
    'n3': 'Moose2'
}
p_animals2 = pd.Series(animals)
animals = {
    'n1': 'Tiger3',
    'n2': 'Bear3',
    'n3': 'Moose3'
}
p_animals3 = pd.Series(animals)

df = pd.DataFrame(
    [p_animals, p_animals2, p_animals3],
    index=['r1', 'r2', 'r3']
)
df

        n1     n2      n3
r1   Tiger   Bear   Moose
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [16]:
df.loc['r2']

n1    Tiger2
n2     Bear2
n3    Moose2
Name: r2, dtype: object

In [17]:
df.loc['r2'].loc['n1']

'Tiger2'

In [18]:
df.loc['r2', 'n1']

'Tiger2'

In [19]:
df.T

       r1      r2      r3
n1  Tiger  Tiger2  Tiger3
n2   Bear   Bear2   Bear3
n3  Moose  Moose2  Moose3

In [20]:
df['n2']

r1     Bear
r2    Bear2
r3    Bear3
Name: n2, dtype: object

In [21]:
df.loc[:, ['n2', 'n3']]

       n2      n3
r1   Bear   Moose
r2  Bear2  Moose2
r3  Bear3  Moose3

In [22]:
df[['n2']]

       n2
r1   Bear
r2  Bear2
r3  Bear3

In [23]:
df.drop('r1', inplace=True)

In [24]:
df

        n1     n2      n3
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [25]:
df2 = df

In [26]:
df2.drop('r2', inplace=True)

In [27]:
df2

        n1     n2      n3
r3  Tiger3  Bear3  Moose3

In [28]:
df

        n1     n2      n3
r3  Tiger3  Bear3  Moose3

In [29]:
animals = {
    'n1': 'Tiger',
    'n2': 'Bear',
    'n3': 'Moose'
}
p_animals = pd.Series(animals)
animals = {
    'n1': 'Tiger2',
    'n2': 'Bear2',
    'n3': 'Moose2'
}
p_animals2 = pd.Series(animals)
animals = {
    'n1': 'Tiger3',
    'n2': 'Bear3',
    'n3': 'Moose3'
}
p_animals3 = pd.Series(animals)

df = pd.DataFrame(
    [p_animals, p_animals2, p_animals3],
    index=['r1', 'r2', 'r3']
)
df

        n1     n2      n3
r1   Tiger   Bear   Moose
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [30]:
df3 = df[['n1', 'n2']]
df3

        n1     n2
r1   Tiger   Bear
r2  Tiger2  Bear2
r3  Tiger3  Bear3

In [31]:
df3.drop('r1', inplace=True)

/tmp/ipykernel_20763/3213769377.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop('r1', inplace=True)

In [32]:
df['n1'] = 1
df

    n1     n2      n3
r1   1   Bear   Moose
r2   1  Bear2  Moose2
r3   1  Bear3  Moose3

In [33]:
df['n1'] = df['n1'] * 2
df

    n1     n2      n3
r1   2   Bear   Moose
r2   2  Bear2  Moose2
r3   2  Bear3  Moose3

In [34]:
n2 = df['n2']
n2 += '!'

In [35]:
n2

r1     Bear!
r2    Bear2!
r3    Bear3!
Name: n2, dtype: object

In [36]:
df

    n1      n2      n3
r1   2   Bear!   Moose
r2   2  Bear2!  Moose2
r3   2  Bear3!  Moose3